Осы қымыз қазаққа
Мақтаның ба, асың ба?
Қымызды басар артынан
Ет даяр ма қасында?
Бойыңа сіңіп, уерд болған
Қызба бастық жасында.
Қызылшыл семіз, жаз қымыз
Бір үлкен борыш басыңда.
Жуасты мін де, айран іш,
Жоқ немеге шатылма.
Ұры, залым, қуларға
Нысанаға шаншылма.
Жылқыны андып ұры жүр
Әр төбенің тасында.
Ой көзімен қарасаң,
Қойдан жылқы асыл ма?
Мақтанға бола жиям деп,
Жылқы үшін жұртқа бас ұрма
Қымыз, семіз дегенің
Бір мақтан ғой, жасырма.
Мақтан қума, керек қу,
Ойсыздарға қосылма.
Қойында ақша, қолда қой
Күзетке оңай, шошынба!