Ғылым таппай мақтанба,
Орын таппай баптанба,
Құмарланып шаттанба,
Ойнап босқа күлуге.
Бес нәрседен қашық бол,
Бес нәрсеге асық бол,
Адам болам десеңіз.
Тілеуің, өмірің алдыңда,
Оған қайғы жесеңіз.
Өсек, өтірік, мақтаншақ,
Еріншек, бекер мал шашпақ –
Бес дұшпаның, білсеңіз.
Талап, еңбек, терең ой,
Қанағат, рақым, ойлап қой –
Бес асыл іс, көнсеңіз.
Жамандық көрсең нәфрәтлі,
Суытып көңіл тыйсаңыз.
Жақсылық көрсең ғибрәтлі,
Оны ойға жисаңыз.
Ғалым болмай немене,
Балалықты қисаңыз?
Болмасаң да ұқсап бақ,
Бір ғалымды көрсеңіз.
Ондай болмақ қайда деп,
Айтпа ғылым сүйсеңіз,
Сізге ғылым кім берер,
Жанбай жатып сөнсеңіз?
Дүние де өзі, мал да өзі,
Ғылымға көңіл берсеңіз.
Білгендердің сөзіне
Махаббатпен ерсеңіз.
Ақыл сенбей сенбеңіз,
Бір іске кез келсеңіз.
Ақсақал айтты, бай айтты,
Кім болса, мейлі, сол айтты –
Ақылменен жеңсеңіз.
Надандарға бой берме,
Шын сөзбенен өлсеңіз.
Аят, хадис емес қой,
Күпір болдың демес қой,
Қанша қарсы келсеңіз.
Көп орында көріне айтпа,
Біздің сөзге ерсеңіз.
Мұны жазған кісінің
Атын білме, сөзін біл!
Осы жалған дүниеден
Шешен де өткен не бұлбұл,
Көсем де өткен не дүлдүл.
Сөз мәнісін білсеңіз,
Ақыл – мизан, өлшеу қыл.
Егер қисық көрінсе,
Мейлің таста, мейлің күл.
Егер түзу көрінсе,
Ойлап-ойлап, құлаққа іл.
Ақымақ көп, ақылды аз,
Деме көптің сөзі пұл.
Жақынның сөзі тәтті деп,
Жақыным айтты дей көрме.
Надандықпен кім айтса,
Ондай түпсіз сөзге.ерме.
Сізге айтамын, қаупім - бұл.
Өзің үшін үйренсең,
Жамандықтан жиренсең,
Ашыларсың жылма-жыл.
Біреу үшін үйренсең,
Біреу білмес, сен білсең,
Білгеніңнің бәрі - тұл.
Сөзіне қарай кісіні ал,
Кісіге қарап сөз алма.
Шын сөз қайсы біле алмай,
Әр нәрседен құр қалма.
Мұны жазған білген құл –
Ғұламаһи Дауани,
Солай депті ол шыншыл.
Сөзін оқы және ойла,
Тез үйреніп, тез жойма,
Жас уақытта көңіл - гүл.